In [35]:
import datetime
from datetime import datetime, date
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
pd.set_option('display.notebook_repr_html',True)
pd.set_option('display.max_columns',7)
pd.set_option('display.max_rows',10)
pd.set_option('display.width',250)
%matplotlib inline
from re import match
import os
import json

In [33]:
'''
jumsu = {
'홍길동' : [50,60,50],
'이순동' : [60,60,60],
'강감동' : [100,90,90],
'유관동' : [80,80,90],
'홍길도' : [50,45,50],
'이순도' : [80,70,66],
'강감도' : [64,49,50],
'유관도' : [60,50,50],
'홍길재' : [50,45,51],
'이순재' : [80,70,61],
'강감재' : [64,49,51],
'유관재' : [60,50,51],
'강환석' : [95,95,95]
}
<요구사항1>
다음의 순서대로 코딩하세요.
가. 보기의 jumsu 딕셔너리 중에서 평균 점수가 60점 미만인 사람만 선별하여 또 다른 딕셔너리에 저장하세요.
나. 가. 항에서 만든 또 다른 딕셔너리를 이용하여 데이터(요소)가 평균이고 인덱스가 이름인 Series 를 만드세요.
다. 시리즈를 <실행결과> 와 같이 출력하세요.

<실행결과>

홍길동-홍길도-강감도-유관도-홍길재-강감재-유관재-
53.33--48.33--54.33--53.33--48.67--54.67--53.67--
'''
import pandas as pd
import numpy as np
from statistics import mean
jumsu = {
'홍길동' : [50,60,50],
'이순동' : [60,60,60],
'강감동' : [100,90,90],
'유관동' : [80,80,90],
'홍길도' : [50,45,50],
'이순도' : [80,70,66],
'강감도' : [64,49,50],
'유관도' : [60,50,50],
'홍길재' : [50,45,51],
'이순재' : [80,70,61],
'강감재' : [64,49,51],
'유관재' : [60,50,51],
'강환석' : [95,95,95]
}

jumsu2 = {}
for key, value in jumsu.items():
    if round(np.mean(value)) < 60 :
        jumsu2[key] = round(np.mean(value))

jumsu3 = {key:round(np.mean(value),2) for key, value in jumsu.items() if round(np.mean(value)) < 60}
jumsu3_s = pd.Series(jumsu3)

### 위 평균 60점 미만의 사람들의 총점을 구하여 이름과 총점으로 딕셔너리 생성하세요
### 그리고, 딕셔너리로 시리즈를 만드세요
jumsu4 = {key:np.sum(value) for key, value in jumsu.items() if round(np.mean(value)) < 60}
jumsu4_s = pd.Series(jumsu4)
jumsu_df = pd.DataFrame({'합계':jumsu4_s,'평균':jumsu3_s})
## 홍길도의 평균
jumsu_df['평균']['홍길도']

48.33

In [36]:
#### 날짜 데이터 생성
dates = pd.date_range('2022-04-01','2022-04-7')
print(dates)
## datetime이라는 특별한 형식 인덱스를 생성함
## datetime은 판다스에서 날짜/시간 관련 인덱스

DatetimeIndex(['2022-04-01', '2022-04-02', '2022-04-03', '2022-04-04', '2022-04-05', '2022-04-06', '2022-04-07'], dtype='datetime64[ns]', freq='D')

In [40]:
temps1 = pd.Series([80,82,85,90,92,87,88],index=dates)
temps1
### Pandas에서 DatetimeIndex의 형식으로 인덱스를 사용하는 데이터를 시계열이라 한다

2022-04-01    80
2022-04-02    82
2022-04-03    85
2022-04-04    90
2022-04-05    92
2022-04-06    87
2022-04-07    88
Freq: D, dtype: int64

In [39]:
temps1['2022-04-07']

88

In [43]:
temps2 = pd.Series([60,70,69,83,77,79,75],index=dates)
###temps1 도시의 온도와 temps2 도시의 온도 간 차이를 temps_diff에 저장
temps_diff = temps1-temps2
temps_diff

2022-04-01    20
2022-04-02    12
2022-04-03    16
2022-04-04     7
2022-04-05    15
2022-04-06     8
2022-04-07    13
Freq: D, dtype: int64

In [45]:
temps_diff.mean()   ## numpy에서 제공하는 라이브러리에 있는 mean()와 구분되는 mean이 존재
type(temps_diff)

pandas.core.series.Series

In [47]:
## 문제1
# 위의 temps1, temps2를 이용하여 뺄셈 이외에 다른 연산 가능한지 실습
temps_sum = temps1 + temps2
temps_mul = temps1 * temps2
temps_div = temps1 / temps2

print(temps_sum)
print(temps_mul)
print(temps_div)

## 문제2
# temps3를 생성, temps1과 temps2와 대응하는 시리즈를 생성
# 온도 : 75, 77, 67, 82, 77, 85, 89 인덱스 : dates
temps3 = pd.Series([75,77,67,82,77,85,89],index=dates)
# 이렇게 생성된 temps1, temps2, temps3를 temps_df로 데이터프레임으로 생성
dic1 = {'Missoula':temps1,'Philadelphia':temps2,'Seoul':temps3}
temps_df = pd.DataFrame(dic1)
temps_df

2022-04-01    140
2022-04-02    152
2022-04-03    154
2022-04-04    173
2022-04-05    169
2022-04-06    166
2022-04-07    163
Freq: D, dtype: int64
2022-04-01    4800
2022-04-02    5740
2022-04-03    5865
2022-04-04    7470
2022-04-05    7084
2022-04-06    6873
2022-04-07    6600
Freq: D, dtype: int64
2022-04-01    1.333333
2022-04-02    1.171429
2022-04-03    1.231884
2022-04-04    1.084337
2022-04-05    1.194805
2022-04-06    1.101266
2022-04-07    1.173333
Freq: D, dtype: float64

            Missoula  Philadelphia  Seoul
2022-04-01        80            60     75
2022-04-02        82            70     77
2022-04-03        85            69     67
2022-04-04        90            83     82
2022-04-05        92            77     77
2022-04-06        87            79     85
2022-04-07        88            75     89

### 문제3 각 도시의 평균온도를 구하세요

In [54]:
print(temps_df)
print('-'*40)
print('Missoula\t평균기온 : {:.2f}'.format(temps_df['Missoula'].mean()))
print('Philadelphia\t평균기온 : {:.2f}'.format(temps_df['Philadelphia'].mean()))
print('Seoul\t\t평균기온 : {:.2f}'.format(temps_df['Seoul'].mean()))

            Missoula  Philadelphia  Seoul
2022-04-01        80            60     75
2022-04-02        82            70     77
2022-04-03        85            69     67
2022-04-04        90            83     82
2022-04-05        92            77     77
2022-04-06        87            79     85
2022-04-07        88            75     89
----------------------------------------
Missoula	평균기온 : 86.29
Philadelphia	평균기온 : 73.29
Seoul		평균기온 : 78.86

In [59]:
## 두 개 이상의 컬럼을 한번에 가져오고자 할때 []를 이용한다.
cc = temps_df[['Missoula','Philadelphia']]
cc

            Missoula  Philadelphia
2022-04-01        80            60
2022-04-02        82            70
2022-04-03        85            69
2022-04-04        90            83
2022-04-05        92            77
2022-04-06        87            79
2022-04-07        88            75

In [61]:
## 두 도시의 온도 차이를 붙여보세요
cc_diff = cc['Missoula'] - cc['Philadelphia']
cc['Difference'] = cc_diff
cc

            Missoula  Philadelphia  Difference
2022-04-01        80            60          20
2022-04-02        82            70          12
2022-04-03        85            69          16
2022-04-04        90            83           7
2022-04-05        92            77          15
2022-04-06        87            79           8
2022-04-07        88            75          13

In [65]:
### temps_df 또는 cc데이터프레임의 컬럼명을 모두 출력
cc.columns      # columns -> 데이터프레임에 있는 컬럼을 출력
cc.index
cc.keys
cc.values

Index(['Missoula', 'Philadelphia', 'Difference'], dtype='object')

In [67]:
# 데이터프레임의 인덱스는 기본 인덱스와 사용자 인덱스가 존재한다
# 기본 인덱스는 위치 인덱스라고도 한다
# cc 또는 temps_df에 있는 2022-04-01~2022-04-07의 인덱스는 사용자 인덱스라고 한다
# 슬라이싱을 이용한 방식은 기본 인덱스를 사용하게된다.
cc.Difference[1:4]
cc[1:4]

            Missoula  Philadelphia  Difference
2022-04-02        82            70          12
2022-04-03        85            69          16
2022-04-04        90            83           7

In [69]:
print(cc)
cc[-2:]
cc[-1:]

            Missoula  Philadelphia  Difference
2022-04-01        80            60          20
2022-04-02        82            70          12
2022-04-03        85            69          16
2022-04-04        90            83           7
2022-04-05        92            77          15
2022-04-06        87            79           8
2022-04-07        88            75          13

            Missoula  Philadelphia  Difference
2022-04-07        88            75          13

In [93]:
cc.Philadelphia.loc['2022-04-02':'2022-04-05']
cc.loc['2022-04-02':'2022-04-05']
temps_df.loc['2022-04-02':'2022-04-05']
temps_df.loc['2022-04-02':'2022-04-05',['Seoul']]
temps_df.loc[['2022-04-02','2022-04-05'],['Seoul']]
temps_df.loc['2022-04-02':'2022-04-05',['Seoul','Philadelphia']]

            Seoul  Philadelphia
2022-04-02     77            70
2022-04-03     67            69
2022-04-04     82            83
2022-04-05     77            77

In [95]:
## label을 이용하는 접근(label은 사용자 정의 인덱스를 말함)
# 접근법
# 1. 단일 : [데이터프레임 or Series].loc['label명',['컬럼명',...]]
# DataFrame
temps_df.loc['20220401']
temps_df.loc['2022-04-01',['Seoul','Philadelphia']]
# Series
temps_df.Seoul.loc['20220401']

# 2. 여러개일 경우(특정 인덱스만 출력)
# DataFrame
temps_df.loc[['20220402','20220406'],['Seoul','Philadelphia']]
# Series
temps_df.Seoul.loc[['20220402','20220406']]

# 3. 여러개인 경우(연속된 값인 경우)
# DataFrame
temps_df.loc['20220402':'20220406',['Seoul','Philadelphia']]
# Series
temps_df.Seoul.loc['20220402':'20220406']

# 4. Boolean 값을 이용한 출력(이때에 인덱스 값과 같은 개수의 리스트 개수로 생성)
# DataFrame
ls = [True,False,False,True,False,False,True]
temps_df.loc[ls,['Philadelphia','Seoul']]
# Series
temps_df.Missoula.loc[ls]

2022-04-01    80
2022-04-04    90
2022-04-07    88
Freq: 3D, Name: Missoula, dtype: int64

In [110]:
## 기본 인덱스를 이용하여접근
# 접근법
# 1. 단일 : [데이터프레임 or Series].loc[index값(int)]
# DataFrame
print(temps_df)
temps_df.iloc[3]
temps_df.iloc[3,1]      # Philadelphia의 20220404
# Series
temps_df.Philadelphia.iloc[3]

# 2. 여러개일 경우(특정 인덱스만 출력)
# DataFrame
temps_df.iloc[[1,3,5],[1,2]]
# Series
temps_df.Seoul.iloc[[1,3,5]]

# 3. 여러개인 경우(연속된 값인 경우)
# DataFrame
temps_df.iloc[1:4,[0,2]]
# Series
temps_df.Seoul.iloc[3:]

# 4. Boolean 값을 이용한 출력
# DataFrame
ls = [True,False,False,True,False,False,True]
temps_df.iloc[ls,[0,1,2]]
# Series
temps_df.Missoula.iloc[ls]

            Missoula  Philadelphia  Seoul
2022-04-01        80            60     75
2022-04-02        82            70     77
2022-04-03        85            69     67
2022-04-04        90            83     82
2022-04-05        92            77     77
2022-04-06        87            79     85
2022-04-07        88            75     89

2022-04-01    80
2022-04-04    90
2022-04-07    88
Freq: 3D, Name: Missoula, dtype: int64

In [131]:
## data/sam_kospi.xlsx 파일을 읽어서 DataFrame으로 만들어주세요
goog = pd.read_csv('data/goog.csv')
goog.iloc[0::3]
goog.iloc[0::2,[2,3]]

          High         Low
0   797.659973  786.270020
2   796.676025  787.099976
4   792.739990  787.280029
6   794.229980  783.200012
8   782.780029  770.409973
..         ...         ...
52  833.409973  826.520020
54  842.000000  834.210022
56  848.684998  843.250000
58  848.630005  840.770020
60  853.400024  847.109985

[31 rows x 2 columns]

In [135]:
goog_df = pd.read_csv('data/goog.csv',parse_dates=['Date'],index_col='Date')
goog_df

                  Open        High         Low       Close   Volume
Date
2016-12-19  790.219971  797.659973  786.270020  794.200012  1225900
2016-12-20  796.760010  798.650024  793.270020  796.419983   925100
2016-12-21  795.840027  796.676025  787.099976  794.559998  1208700
2016-12-22  792.359985  793.320007  788.580017  791.260010   969100
2016-12-23  790.900024  792.739990  787.280029  789.909973   623400
...                ...         ...         ...         ...      ...
2017-03-13  844.000000  848.684998  843.250000  845.539978  1149500
2017-03-14  843.640015  847.239990  840.799988  845.619995   779900
2017-03-15  847.590027  848.630005  840.770020  847.200012  1379600
2017-03-16  849.030029  850.849976  846.130005  848.780029   970400
2017-03-17  851.609985  853.400024  847.109985  852.119995  1712300

[61 rows x 5 columns]

In [ ]:
pip list